<?php

return [
    'application_accepted' => [
        'subject' => 'Ваша заявка принята!',
    ],

    'new_device' => [
        'text' => 'Недавно вы пытались войти в свой аккаунт :sitename из нового местоположения или с нового устройства. Ознакомьтесь с данными этой попытки входа, и подтвердите, что это были вы.',
    ],

    'verify_email' => [
        'text' => 'Спасибо за регистрацию на сервисе :sitename! Для подтверждения почты нажмите на кнопку ниже. Если вы этого не делали, проигнорируйте письмо.',
    ],

    'user_lockout' => [
        'text' => 'Мы обнаружили многочисленное количество неудачных авторизаций и для безопасности ваша учетная запись временно заблокировано.',
    ],

    'user_register' => [
        'text' => 'Поздравляем Вас с успешной регистрацией на сайте :sitename',
    ],
];
